In [30]:
import pandas as pd

In [35]:
PATH = "/Users/jon/Desktop/data-cleaning-project/data/usps_zipcodes_20130301.csv"
df = pd.read_csv(PATH)
df.head()

   ZipCode      Type        City State  IsPrimaryCity
0      501    Unique  HOLTSVILLE    NY              1
1      544    Unique  HOLTSVILLE    NY              1
2      601  Standard    ADJUNTAS    PR              1
3      602  Standard      AGUADA    PR              1
4      603  Standard   AGUADILLA    PR              1

In [36]:
dftrimmed = df.where(df['State']=='HI')

In [37]:
#dftrimmed = dftrimmed.dropna(inplace=True)
dftrimmed.head()

   ZipCode Type City State  IsPrimaryCity
0      NaN  NaN  NaN   NaN            NaN
1      NaN  NaN  NaN   NaN            NaN
2      NaN  NaN  NaN   NaN            NaN
3      NaN  NaN  NaN   NaN            NaN
4      NaN  NaN  NaN   NaN            NaN

In [38]:
dftrimmed = dftrimmed.dropna()
dftrimmed = dftrimmed.drop(labels=["IsPrimaryCity", "Type","State"], axis=1)
dftrimmed = dftrimmed.astype({"ZipCode":"Int32", "City": "string"})
dftrimmed.head()

       ZipCode          City
49119    96701          AIEA
49120    96703       ANAHOLA
49121    96704  CAPTAIN COOK
49122    96704    OCEAN VIEW
49123    96705        ELEELE

In [39]:
dftrimmed.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 147 entries, 49119 to 49266
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   ZipCode  147 non-null    Int32
 1   City     147 non-null    string
dtypes: Int32(1), string(1)
memory usage: 8.0 KB

In [ ]:
WRITE_PATH = "/Users/jon/Desktop/data-cleaning-project/data/trimmed-zipcode.csv"
dftrimmed.to_csv(WRITE_PATH)